jutoroa/STM32F411RE/examenFinal_jutoroaV4/Src/examenFinalMainV4.c
			// NOTA: Descomentar si se quieren ver también los valores por consola
/*
			// Imprimimos los valores por consola
			sprintf(MPUBufferAccel, " %f | %f | %f \n \r",fAccelX,fAccelY,fAccelZ);
			writeMsg(&handlerCommTerminal, MPUBufferAccel);
*/
			// Imprimimos los valores por la pantalla OLED
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, " ACCELX: %f ", fAccelX);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_1);
			sprintf(bufferDataOLEDx, " ACCELY: %f ", fAccelY);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_3);
			sprintf(bufferDataOLEDx, " ACCELZ: %f ", fAccelZ);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_5);

			// Bajamos la bandera que controla el TIMER
			MPU6050IsReady = false;
		}
		// Comparaciones para obtener los datos del MPU en modo continuo
		else if((MPU6050IsReady == true) && (gyrosFull == true)){

			// Leemos los valores del giroscopio del MPU6050 en x,y, y z.
			int16_t GirosX = MPU6050_SensorValue(&handler_MPU6050,GYRO_X);
			int16_t GirosY = MPU6050_SensorValue(&handler_MPU6050,GYRO_Y);
			int16_t GirosZ = MPU6050_SensorValue(&handler_MPU6050,GYRO_Z);

			double fGirosX = GirosX*(250.0/32768.0);
			double fGirosY = GirosY*(250.0/32768.0);
			double fGirosZ = GirosZ*(250.0/32768.0);

			// NOTA: Descomentar si se quieren ver también los valores por consola
/*
			// Imprimimos los valores por consola
			sprintf(MPUBufferGyro, " %f | %f | %f \n \r",fGirosX,fGirosY,fGirosZ);
			writeMsg(&handlerCommTerminal, MPUBufferGyro);
*/
			// Imprimimos los valores por la pantalla OLED
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, " GYROX: %f ", fGirosX);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_1);
			sprintf(bufferDataOLEDx, " GYROY: %f ", fGirosY);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_3);
			sprintf(bufferDataOLEDx, " GYROZ: %f ", fGirosZ);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_5);

			// Bajamos la bandera que controla el TIMER
			MPU6050IsReady = false;
		}

		// Comparaciones para obtener los datos del RTC en modo continuo
		if((rtcContIsReady == true) && (rtcContFlag == true)){

			// Leemos los valores del giroscopio del RTC.
			uint8_t sec 	= RTC_readByte(&handler_RTC,0x00);
			uint8_t min 	= RTC_readByte(&handler_RTC,0x01);
			uint8_t hora 	= RTC_readByte(&handler_RTC,0x02);
			uint8_t day 	= RTC_readByte(&handler_RTC,0x04);
			uint8_t month 	= RTC_readByte(&handler_RTC,0x05);
			uint8_t year 	= RTC_readByte(&handler_RTC,0x06);

			// Imprimimos los valores por consola
			sprintf(bufferData, "| TIME: %d:%d:%d | DATE: %d/%d/%d |\n" , (int) hora, (int) min, (int) sec,
					(int) day, (int) month, (int) year);
			writeMsg(&handlerCommTerminal, bufferData);

			// Imprimimos los valores por la pantalla OLED
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, " %d:%d:%d ",(int) hora, (int) min, (int) sec);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_3);
			sprintf(bufferDataOLEDx, " %d/%d/%d ",(int) day, (int) month, (int) year);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_7);

			// Bajamos la bandera que controla el TIMER
			rtcContIsReady = false;
		}
		// Comparaciones para el modo de auto destrucción
		if((buzzerFlagTimer == true) && (buzzerFlagCommand == true)){

			// Switcheamos el estado del LED STOP y del BUZZER
			handlerPinBUZZER.pGPIOx -> ODR ^= GPIO_ODR_OD0;
			handlerPinSTOP.pGPIOx -> ODR ^= GPIO_ODR_OD2;

			// Imprimimos mensaje de autodestrucción
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, " EN %d S", counterDestruction);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_5);
			// Si la autodestrucción llega a 0, se muere el LED y el BUZZER
			if(counterDestruction == 0){
				buzzerFlagCommand = false;
				char bufferDataOLEDx[128] = {0};
				sprintf(bufferDataOLEDx, "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF");
				OLED_FPrint(&handler_OLED, bufferDataOLEDx);
				GPIO_WritePin(&handlerPinSTOP, RESET);
				GPIO_WritePin(&handlerPinBUZZER, SET);
			}
			buzzerFlagTimer = false;
		}
	}
}
//***********// *********** // Definición de Funciones // *********** //***********//

//***********// InitSystem //***********//

// Función que define la configuración de todos los pines y periféricos

void initSystem(void){

	// Configuración el State LED
	handlerStateLED.pGPIOx								= GPIOA;
	handlerStateLED.GPIO_PinConfig.GPIO_PinNumber		= PIN_5;
	handlerStateLED.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_OUT;
	handlerStateLED.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;
	handlerStateLED.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	handlerStateLED.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_FAST;

	//Cargamos la configuración
	GPIO_Config(&handlerStateLED);
	// Prendemos el LED
	GPIO_WritePin(&handlerStateLED, SET);

	// Configuración el START LED
	handlerPinSTART.pGPIOx								= GPIOA;
	handlerPinSTART.GPIO_PinConfig.GPIO_PinNumber		= PIN_0;
	handlerPinSTART.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_OUT;
	handlerPinSTART.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;
	handlerPinSTART.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	handlerPinSTART.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_FAST;

	//Cargamos la configuración
	GPIO_Config(&handlerPinSTART);
	GPIO_WritePin(&handlerPinSTART, RESET);

	// Configuración el STOPLED
	handlerPinSTOP.pGPIOx								= GPIOC;
	handlerPinSTOP.GPIO_PinConfig.GPIO_PinNumber		= PIN_2;
	handlerPinSTOP.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_OUT;
	handlerPinSTOP.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;
	handlerPinSTOP.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	handlerPinSTOP.GPIO_PinConfig.GPIO_PinSpeed			= GPIO_OSPEED_FAST;

	//Cargamos la configuración
	GPIO_Config(&handlerPinSTOP);
	GPIO_WritePin(&handlerPinSTOP, RESET);

	// Configuración PinBUZZER
	handlerPinBUZZER.pGPIOx								= GPIOB;
	handlerPinBUZZER.GPIO_PinConfig.GPIO_PinNumber		= PIN_0;
	handlerPinBUZZER.GPIO_PinConfig.GPIO_PinMode		= GPIO_MODE_OUT;
	handlerPinBUZZER.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;
	handlerPinBUZZER.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	handlerPinBUZZER.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_FAST;

	//Cargamos la configuración
	GPIO_Config(&handlerPinBUZZER);
	GPIO_WritePin(&handlerPinBUZZER, RESET);

	/* Configurando los pines sobre los que funciona el USART */
	handlerPinTX.pGPIOx									= GPIOA;
	handlerPinTX.GPIO_PinConfig.GPIO_PinNumber			= PIN_11;
	handlerPinTX.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_ALTFN;
	handlerPinTX.GPIO_PinConfig.GPIO_PinOPType			= GPIO_OTYPE_PUSHPULL;
	handlerPinTX.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_NOTHING;
	handlerPinTX.GPIO_PinConfig.GPIO_PinSpeed			= GPIO_OSPEED_FAST;
	handlerPinTX.GPIO_PinConfig.GPIO_PinAltFunMode		= AF8;

	GPIO_Config(&handlerPinTX);

	handlerPinRX.pGPIOx									= GPIOA;
	handlerPinRX.GPIO_PinConfig.GPIO_PinNumber			= PIN_12;
	handlerPinRX.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_ALTFN;
	handlerPinRX.GPIO_PinConfig.GPIO_PinOPType			= GPIO_OTYPE_PUSHPULL;
	handlerPinRX.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_NOTHING;
	handlerPinRX.GPIO_PinConfig.GPIO_PinSpeed			= GPIO_OSPEED_FAST;
	handlerPinRX.GPIO_PinConfig.GPIO_PinAltFunMode		= AF8;

	GPIO_Config(&handlerPinRX);


	handlerCommTerminal.ptrUSARTx							= USART6;
	handlerCommTerminal.USART_Config.USART_mode				= USART_MODE_RXTX;
	handlerCommTerminal.USART_Config.USART_baudrate			= USART_BAUDRATE_19200;
	handlerCommTerminal.USART_Config.USART_datasize			= USART_DATASIZE_8BIT;
	handlerCommTerminal.USART_Config.USART_parity			= USART_PARITY_ODD;
	handlerCommTerminal.USART_Config.USART_stopbits			= USART_STOPBIT_1;
	handlerCommTerminal.USART_Config.USART_interrupt		= USART_INTERRUPT_RX_ENABLE;

	USART_Config(&handlerCommTerminal);

	// Configuración del timer2
	handlerTimer2.ptrTIMx								= TIM2;
	handlerTimer2.timerConfig.Timer_mode				= TIMER_MODE_UP;
	handlerTimer2.timerConfig.Timer_speed				= TIMER_INCR_SPEED_1ms;
	handlerTimer2.timerConfig.Timer_period				= 250;

	Timer_Config(&handlerTimer2);

	// Configuración del timer5
	handlerTimer5.ptrTIMx								= TIM5;
	handlerTimer5.timerConfig.Timer_mode				= TIMER_MODE_UP;
	handlerTimer5.timerConfig.Timer_speed				= TIMER_INCR_SPEED_1ms;
	handlerTimer5.timerConfig.Timer_period				= 150;

	Timer_Config(&handlerTimer5);

