jutoroa/STM32F411RE/examenFinal_jutoroaV4/Src/examenFinalMainV4.c
		// Escribimos un mensaje de confirmación por consola
		writeMsg(&handlerCommTerminal, "\n");
		writeMsg(&handlerCommTerminal, "MPU6050 ha sido inicializado correctamente. \n");
		i2cBuffer = MPU6050_readByte(&handler_MPU6050, MPU6050_RA_PWR_MGMT_1);
		sprintf(bufferData, "Registro PWR MGMT = 0x%2x \n", (unsigned int) i2cBuffer);
		writeMsg(&handlerCommTerminal, bufferData);

		// Escribimos un mensaje de confirmación a través de la OLED
		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, "EL MPU6050 HA   SIDO INICIADO   CORRECTAMENTE");
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);

	}
	else if(strcmp(cmd, "accel") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Mostrar en eje X la aceleración
		if(firstParameter == 1){
			// Mostrar por consola
			int16_t AccelX = MPU6050_SensorValue(&handler_MPU6050,ACCEL_X);
			sprintf(bufferData, "AccelX = %d \n",(int) AccelX);
			writeMsg(&handlerCommTerminal, bufferData);

			// Mostrar por OLED
			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   ACCELX = %d \n",(int) AccelX);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		// Mostrar en eje Y la aceleración
		else if(firstParameter == 2){
			// Mostrar por consolar
			int16_t AccelY = MPU6050_SensorValue(&handler_MPU6050,ACCEL_Y);
			sprintf(bufferData, "AccelY = %d \n",(int) AccelY);
			writeMsg(&handlerCommTerminal, bufferData);

			// Mostrar por OLED
			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   ACCELY = %d \n",(int) AccelY);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		// Mostrar en eje Z la aceleración
		else if(firstParameter == 3){
			// Mostrar por consolar
			int16_t AccelZ = MPU6050_SensorValue(&handler_MPU6050,ACCEL_Z);
			sprintf(bufferData, "AccelZ = %d \n",(int) AccelZ);
			writeMsg(&handlerCommTerminal, bufferData);

			// Mostrar por OLED
			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   ACCELZ = %d \n",(int) AccelZ);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		// Imprimir error si el usuario pone un valor no disponible
		else{
			writeMsg(&handlerCommTerminal, "Acelerómetro no disponible \n");

			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "                !!!! ERROR !!!!");
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
	}
	else if(strcmp(cmd, "gyro") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Mostrar en eje X la velocidad angular
		if(firstParameter == 1){
			// Se imprime por consola
			int16_t GirosX = MPU6050_SensorValue(&handler_MPU6050,GYRO_X);
			sprintf(bufferData, "GirosX = %d \n",(int) GirosX);
			writeMsg(&handlerCommTerminal, bufferData);

			// Se imprime por la pantalla OLED
			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   GYROX = %d \n",(int) GirosX);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		// Mostrar en eje X la velocidad angular
		else if(firstParameter == 2){
			// Se imprime por consola
			int16_t GirosY = MPU6050_SensorValue(&handler_MPU6050,GYRO_Y);
			sprintf(bufferData, "GirosY = %d \n",(int) GirosY);
			writeMsg(&handlerCommTerminal, bufferData);

			// Se imprime por OLED
			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   GYROY = %d \n",(int) GirosY);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		// Mostrar en eje Z la velocidad angular
		else if(firstParameter == 3){
			// Se imprime por consola
			int16_t GirosZ = MPU6050_SensorValue(&handler_MPU6050,GYRO_Z);
			sprintf(bufferData, "GirosZ = %d \n",(int) GirosZ);
			writeMsg(&handlerCommTerminal, bufferData);

			// Se imprime por OLED
			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   GYROZ = %d \n",(int) GirosZ);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		// Imprimir error si el usuario pone un valor no disponible
		else{
			writeMsg(&handlerCommTerminal, "Giroscopio no disponible \n");
			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "                !!!! ERROR !!!!");
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
	}
	// Actualizar constantemente la aceleración
	else if(strcmp(cmd, "accelfull") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Se imprime por consola
		writeMsg(&handlerCommTerminal, "Aceleración Modo Continuo \n");
		writeMsg(&handlerCommTerminal, "X | Y | Z \n");

		// Conversión de modo continua
		accelFull = true;
		OLED_Clean(&handler_OLED);
	}
	// Actualizar constantemente la velocidad angular
	else if(strcmp(cmd, "gyrofull") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();
		// Se imprime por consola
		writeMsg(&handlerCommTerminal, "Giroscopio Modo Continuo \n");
		writeMsg(&handlerCommTerminal, "X | Y | Z \n");

		// Conversión de modo continua
		gyrosFull = true;
		OLED_Clean(&handler_OLED);
	}
	else if(strcmp(cmd, "initrtc") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Función para inicializar el RTC
		RTC_init(&handler_RTC);
		writeMsg(&handlerCommTerminal, "\n");
		writeMsg(&handlerCommTerminal, "Su RTC DS1307 ha sido inicializado correctamente. \n");

		// Se imprime una confirmación por OLED
		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " EL RTC HA       SIDO INICIADO   CORRECTAMENTE");
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);
	}
	else if(strcmp(cmd, "setrtc") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Función para setear los valores iniciales del RTC
		defineSetAndTimeRTC(23, 42);
		RTC_SetDateTime(&handler_RTC, &dateAndTimeRTC);

