jutoroa/STM32F411RE/examenFinal_jutoroaV4/Src/examenFinalMainV4.c
		// Se imprime por consola
		writeMsg(&handlerCommTerminal, "\n");
		sprintf(bufferData, "Se ha configurado la hora a %d:%d:%d \n",(int) dateAndTimeRTC.hour,
				(int) dateAndTimeRTC.minutes, (int) dateAndTimeRTC.seconds);
		writeMsg(&handlerCommTerminal, bufferData);

		// Se imprime por OLED
		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " HORA INICIAL:    %d:%d:%d \n",(int) dateAndTimeRTC.hour,
				(int) dateAndTimeRTC.minutes, (int) dateAndTimeRTC.seconds);
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
	else if(strcmp(cmd, "showtime") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Función para leer, horas, minutos y segundos.
		uint8_t sec = RTC_readByte(&handler_RTC,0x00);
		uint8_t min = RTC_readByte(&handler_RTC,0x01);
		uint8_t hora = RTC_readByte(&handler_RTC,0x02);

		// Se imprime por consola
		writeMsg(&handlerCommTerminal, "\n");
		sprintf(bufferData, "La hora actual es %d:%d:%d \n", (int) hora, (int) min, (int) sec);
		writeMsg(&handlerCommTerminal, bufferData);

		// Se imprime por OLED
		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " HORA ACTUAL:    %d:%d:%d \n",(int) hora, (int) min, (int) sec);
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);
	}
	else if(strcmp(cmd, "showdate") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Función para leer la fecha en formato DD/MM/YY
		uint8_t day = RTC_readByte(&handler_RTC,0x04);
		uint8_t month = RTC_readByte(&handler_RTC,0x05);
		uint8_t year = RTC_readByte(&handler_RTC,0x06);

		// Se imprime por consola
		writeMsg(&handlerCommTerminal, "\n");
		sprintf(bufferData, "La fecha actual es %d/%d/%d \n", (int) day, (int) month, (int) year);
		writeMsg(&handlerCommTerminal, bufferData);

		// Se imprime por OLED
		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " FECHA ACTUAL:   %d:%d:%d \n",(int) day, (int) month, (int) year);
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);
	}
	else if(strcmp(cmd, "showtimecont") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		controlLED();

		// Función para leer la hora en tiempo real
		rtcContFlag = true;
		writeMsg(&handlerCommTerminal, "// ***** // RTC MODO CONTINUO // ***** // \n");
		OLED_Clean(&handler_OLED);

		// Se imprime por OLED
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " HORA:");
		OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_1);
		sprintf(bufferDataOLEDx, " FECHA:");
		OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_5);
	}
	else if(strcmp(cmd, "selfdestruction") == 0){
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Cargamos la configuración para los pines
		GPIO_WritePin(&handlerPinSTART, RESET);
		GPIO_WritePin(&handlerPinSTOP, SET);
		writeMsg(&handlerCommTerminal, "// ***** // MODO DE AUTODESTRUCCION // ***** // \n");
		OLED_Clean(&handler_OLED);

		// Se imprime por OLED
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " INICIANDO ");
		OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_1);
		sprintf(bufferDataOLEDx, " AUTODESTRUCCION");
		OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_3);

		// Se define el tiempo de autodestrucción
		counterDestruction = 10;
		buzzerFlagCommand = true;
		}
	// Comandos no válidos
	else{
		// Sección en donde se apagan todas las conversiones continuas
		stopMPU();
		rtcContFlag = false;
		controlLED();

		// Se imprime el mensaje "Wrong CMD" si la escritura no corresponde a los CMD implementados.
		writeMsg(&handlerCommTerminal, "Wrong CMD");
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, "                !!!! ERROR !!!!");
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);

	}
}

//***********// stopMPU //***********//

// Función encargada de apagar todas las conversiones continuas del MPU
void stopMPU(void){
	accelFull = false;
	gyrosFull = false;
	MPU6050IsReady = false;
}

//***********// controlLED //***********//

// Función encargada de controlar el STOP, START y BUZZER
void controlLED(void){
	GPIO_WritePin(&handlerPinSTOP, RESET);
	GPIO_WritePin(&handlerPinSTART, RESET);
	GPIO_WritePin(&handlerPinSTART, SET);
	GPIO_WritePin(&handlerPinBUZZER, RESET);
	buzzerFlagCommand = false;
}


//***********// initialMessage //***********//

// Función con el mensaje inicial
void initialMessage(void){
	writeMsg(&handlerCommTerminal,"// ***** // BIENVENIDO AL STM32 // ***** // \n");
	writeMsg(&handlerCommTerminal, "\n");
	writeMsg(&handlerCommTerminal,"─▌█──║─║╔═║─║─╔═╗─ \n");
	writeMsg(&handlerCommTerminal,"─███─╠═╣╠═║─║─║─║─ \n");
	writeMsg(&handlerCommTerminal,"─▐█▐─║─║╚═╚═╚═╚═╝─ \n");
	writeMsg(&handlerCommTerminal,"─▐▐─────────────── \n");
	writeMsg(&handlerCommTerminal,"─▐▐─────────────── \n");
	writeMsg(&handlerCommTerminal, "\n");
	writeMsg(&handlerCommTerminal, bufferData);
	writeMsg(&handlerCommTerminal, "\n");
	writeMsg(&handlerCommTerminal, "Escriba 'help @', para conocer el menú de ayuda. \n");
}
//***********// CallBacks //***********//

void USART6_Callback(void){
	// Lectura de los datos recibidos
	rxData = returnData();
}

// Timer encargado del StateLED
void Timer2_Callback(void){
	handlerStateLED.pGPIOx -> ODR ^= GPIO_ODR_OD5;		// Encendido y apagado StateLED
	buzzerFlagTimer = true;
}

// // Timer encargado del muestreo a través del RTC
void Timer4_Callback(void){
	rtcContIsReady = true;
	counterDestruction--;
}

// Timer encargado del muestreo a través del MPU6050
void Timer5_Callback(void){
	MPU6050IsReady = true;
}
